Hi @br1serrano Thanks for the feedback. We are looking for the reason why fortios_system_fortimanager does not work. sorry for this. Can you please provide me your FortiGate firemware version? (GUI: Dashboard->Status->System Information->Fireware or CLI: get system status->Version,  the version field is enough) 

BTW: Could you replace your configuration with the following resources to work for you first?

**# cat maintst.tf**
```
provider "fortios" {
  hostname = "192.168.52.177"
  token = "krs096zp3zhcqG8x6scxG1j3tHgnrg" 
  insecure = "true"
}

resource "fortios_system_centralmanagement" "trname" {
  allow_monitor                 = "enable"
  allow_push_configuration      = "enable"
  allow_push_firmware           = "enable"
  allow_remote_firmware_upgrade = "enable"
  enc_algorithm                 = "high"
  fmg                           = "\"192.168.52.177\""
  include_default_servers       = "enable"
  mode                          = "normal"
  type                          = "fortimanager"
  vdom                          = "root"
}

```
**# terraform plan**
...
**# terraform apply**
```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:


  # fortios_system_centralmanagement.trname will be created
  + resource "fortios_system_centralmanagement" "trname" {
      + allow_monitor                 = "enable"
      + allow_push_configuration      = "enable"
      + allow_push_firmware           = "enable"
      + allow_remote_firmware_upgrade = "enable"
      + enc_algorithm                 = "high"
      + fmg                           = "\"192.168.52.177\""
      + fmg_source_ip                 = (known after apply)
      + fmg_source_ip6                = (known after apply)
      + id                            = (known after apply)
      + include_default_servers       = "enable"
      + mode                          = "normal"
      + schedule_config_restore       = (known after apply)
      + schedule_script_restore       = (known after apply)
      + serial_number                 = (known after apply)
      + type                          = "fortimanager"
      + vdom                          = "root"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_centralmanagement.trname: Creating...
fortios_system_centralmanagement.trname: Creation complete after 0s [id=SystemCentralManagement]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
Thanks